grevaillot/svd_tools/headers/STM32L4x1/can1.h
#define CAN1_RI1R_EXID_SHIFT		3
#define CAN1_RI1R_EXID_MASK		0x3ffff
/** @defgroup can1_ri1r_exid EXID EXID
@{*/
/**@}*/

/** CAN1_RI1R_IDE IDE **/
#define CAN1_RI1R_IDE		(1 << 2)
/** CAN1_RI1R_RTR RTR **/
#define CAN1_RI1R_RTR		(1 << 1)

/**@}*/

/** @defgroup can1_rdt1r RDT1R mailbox data high register
@{*/


#define CAN1_RDT1R_TIME_SHIFT		16
#define CAN1_RDT1R_TIME_MASK		0xffff
/** @defgroup can1_rdt1r_time TIME TIME
@{*/
/**@}*/


#define CAN1_RDT1R_FMI_SHIFT		8
#define CAN1_RDT1R_FMI_MASK		0xff
/** @defgroup can1_rdt1r_fmi FMI FMI
@{*/
/**@}*/


#define CAN1_RDT1R_DLC_SHIFT		0
#define CAN1_RDT1R_DLC_MASK		0x0f
/** @defgroup can1_rdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_rdl1r RDL1R mailbox data high register
@{*/


#define CAN1_RDL1R_DATA3_SHIFT		24
#define CAN1_RDL1R_DATA3_MASK		0xff
/** @defgroup can1_rdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN1_RDL1R_DATA2_SHIFT		16
#define CAN1_RDL1R_DATA2_MASK		0xff
/** @defgroup can1_rdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN1_RDL1R_DATA1_SHIFT		8
#define CAN1_RDL1R_DATA1_MASK		0xff
/** @defgroup can1_rdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN1_RDL1R_DATA0_SHIFT		0
#define CAN1_RDL1R_DATA0_MASK		0xff
/** @defgroup can1_rdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_rdh1r RDH1R mailbox data high register
@{*/


#define CAN1_RDH1R_DATA7_SHIFT		24
#define CAN1_RDH1R_DATA7_MASK		0xff
/** @defgroup can1_rdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN1_RDH1R_DATA6_SHIFT		16
#define CAN1_RDH1R_DATA6_MASK		0xff
/** @defgroup can1_rdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN1_RDH1R_DATA5_SHIFT		8
#define CAN1_RDH1R_DATA5_MASK		0xff
/** @defgroup can1_rdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN1_RDH1R_DATA4_SHIFT		0
#define CAN1_RDH1R_DATA4_MASK		0xff
/** @defgroup can1_rdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_fmr FMR filter master register
@{*/

/** CAN1_FMR_FINIT Filter initialization mode **/
#define CAN1_FMR_FINIT		(1 << 0)

/**@}*/

/** @defgroup can1_fm1r FM1R filter mode register
@{*/

/** CAN1_FM1R_FBM13 Filter mode **/
#define CAN1_FM1R_FBM13		(1 << 13)
/** CAN1_FM1R_FBM12 Filter mode **/
#define CAN1_FM1R_FBM12		(1 << 12)
/** CAN1_FM1R_FBM11 Filter mode **/
#define CAN1_FM1R_FBM11		(1 << 11)
/** CAN1_FM1R_FBM10 Filter mode **/
#define CAN1_FM1R_FBM10		(1 << 10)
/** CAN1_FM1R_FBM9 Filter mode **/
#define CAN1_FM1R_FBM9		(1 << 9)
/** CAN1_FM1R_FBM8 Filter mode **/
#define CAN1_FM1R_FBM8		(1 << 8)
/** CAN1_FM1R_FBM7 Filter mode **/
#define CAN1_FM1R_FBM7		(1 << 7)
/** CAN1_FM1R_FBM6 Filter mode **/
#define CAN1_FM1R_FBM6		(1 << 6)
/** CAN1_FM1R_FBM5 Filter mode **/
#define CAN1_FM1R_FBM5		(1 << 5)
/** CAN1_FM1R_FBM4 Filter mode **/
#define CAN1_FM1R_FBM4		(1 << 4)
/** CAN1_FM1R_FBM3 Filter mode **/
#define CAN1_FM1R_FBM3		(1 << 3)
/** CAN1_FM1R_FBM2 Filter mode **/
#define CAN1_FM1R_FBM2		(1 << 2)
/** CAN1_FM1R_FBM1 Filter mode **/
#define CAN1_FM1R_FBM1		(1 << 1)
/** CAN1_FM1R_FBM0 Filter mode **/
#define CAN1_FM1R_FBM0		(1 << 0)

/**@}*/

/** @defgroup can1_fs1r FS1R filter scale register
@{*/

/** CAN1_FS1R_FSC13 Filter scale configuration **/
#define CAN1_FS1R_FSC13		(1 << 13)
/** CAN1_FS1R_FSC12 Filter scale configuration **/
#define CAN1_FS1R_FSC12		(1 << 12)
/** CAN1_FS1R_FSC11 Filter scale configuration **/
#define CAN1_FS1R_FSC11		(1 << 11)
/** CAN1_FS1R_FSC10 Filter scale configuration **/
#define CAN1_FS1R_FSC10		(1 << 10)
/** CAN1_FS1R_FSC9 Filter scale configuration **/
#define CAN1_FS1R_FSC9		(1 << 9)
/** CAN1_FS1R_FSC8 Filter scale configuration **/
#define CAN1_FS1R_FSC8		(1 << 8)
/** CAN1_FS1R_FSC7 Filter scale configuration **/
#define CAN1_FS1R_FSC7		(1 << 7)
/** CAN1_FS1R_FSC6 Filter scale configuration **/
#define CAN1_FS1R_FSC6		(1 << 6)
/** CAN1_FS1R_FSC5 Filter scale configuration **/
#define CAN1_FS1R_FSC5		(1 << 5)
/** CAN1_FS1R_FSC4 Filter scale configuration **/
#define CAN1_FS1R_FSC4		(1 << 4)
/** CAN1_FS1R_FSC3 Filter scale configuration **/
#define CAN1_FS1R_FSC3		(1 << 3)
/** CAN1_FS1R_FSC2 Filter scale configuration **/
#define CAN1_FS1R_FSC2		(1 << 2)
/** CAN1_FS1R_FSC1 Filter scale configuration **/
#define CAN1_FS1R_FSC1		(1 << 1)
/** CAN1_FS1R_FSC0 Filter scale configuration **/
#define CAN1_FS1R_FSC0		(1 << 0)

/**@}*/

/** @defgroup can1_ffa1r FFA1R filter FIFO assignment register
@{*/

/** CAN1_FFA1R_FFA13 Filter FIFO assignment for filter 13 **/
#define CAN1_FFA1R_FFA13		(1 << 13)
/** CAN1_FFA1R_FFA12 Filter FIFO assignment for filter 12 **/
#define CAN1_FFA1R_FFA12		(1 << 12)
/** CAN1_FFA1R_FFA11 Filter FIFO assignment for filter 11 **/
#define CAN1_FFA1R_FFA11		(1 << 11)
/** CAN1_FFA1R_FFA10 Filter FIFO assignment for filter 10 **/
#define CAN1_FFA1R_FFA10		(1 << 10)
/** CAN1_FFA1R_FFA9 Filter FIFO assignment for filter 9 **/
#define CAN1_FFA1R_FFA9		(1 << 9)
/** CAN1_FFA1R_FFA8 Filter FIFO assignment for filter 8 **/
#define CAN1_FFA1R_FFA8		(1 << 8)
/** CAN1_FFA1R_FFA7 Filter FIFO assignment for filter 7 **/
#define CAN1_FFA1R_FFA7		(1 << 7)
/** CAN1_FFA1R_FFA6 Filter FIFO assignment for filter 6 **/
#define CAN1_FFA1R_FFA6		(1 << 6)
/** CAN1_FFA1R_FFA5 Filter FIFO assignment for filter 5 **/
#define CAN1_FFA1R_FFA5		(1 << 5)
/** CAN1_FFA1R_FFA4 Filter FIFO assignment for filter 4 **/
#define CAN1_FFA1R_FFA4		(1 << 4)
/** CAN1_FFA1R_FFA3 Filter FIFO assignment for filter 3 **/
#define CAN1_FFA1R_FFA3		(1 << 3)
/** CAN1_FFA1R_FFA2 Filter FIFO assignment for filter 2 **/
#define CAN1_FFA1R_FFA2		(1 << 2)
/** CAN1_FFA1R_FFA1 Filter FIFO assignment for filter 1 **/
#define CAN1_FFA1R_FFA1		(1 << 1)
/** CAN1_FFA1R_FFA0 Filter FIFO assignment for filter 0 **/
#define CAN1_FFA1R_FFA0		(1 << 0)

/**@}*/

/** @defgroup can1_fa1r FA1R filter activation register
@{*/

/** CAN1_FA1R_FACT13 Filter active **/
#define CAN1_FA1R_FACT13		(1 << 13)
/** CAN1_FA1R_FACT12 Filter active **/
#define CAN1_FA1R_FACT12		(1 << 12)
/** CAN1_FA1R_FACT11 Filter active **/
#define CAN1_FA1R_FACT11		(1 << 11)
/** CAN1_FA1R_FACT10 Filter active **/
#define CAN1_FA1R_FACT10		(1 << 10)
/** CAN1_FA1R_FACT9 Filter active **/
#define CAN1_FA1R_FACT9		(1 << 9)
/** CAN1_FA1R_FACT8 Filter active **/
#define CAN1_FA1R_FACT8		(1 << 8)
/** CAN1_FA1R_FACT7 Filter active **/
#define CAN1_FA1R_FACT7		(1 << 7)
/** CAN1_FA1R_FACT6 Filter active **/
#define CAN1_FA1R_FACT6		(1 << 6)
/** CAN1_FA1R_FACT5 Filter active **/
#define CAN1_FA1R_FACT5		(1 << 5)
/** CAN1_FA1R_FACT4 Filter active **/
#define CAN1_FA1R_FACT4		(1 << 4)
/** CAN1_FA1R_FACT3 Filter active **/
#define CAN1_FA1R_FACT3		(1 << 3)
/** CAN1_FA1R_FACT2 Filter active **/
#define CAN1_FA1R_FACT2		(1 << 2)
/** CAN1_FA1R_FACT1 Filter active **/
#define CAN1_FA1R_FACT1		(1 << 1)
/** CAN1_FA1R_FACT0 Filter active **/
#define CAN1_FA1R_FACT0		(1 << 0)

/**@}*/

/** @defgroup can1_f0r1 F0R1 Filter bank 0 register 1
@{*/

